results/cpu-vs-latency2/memcached/9-1/nsl204.out
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  60 secs]  0 threads:     3995024 ops,   65079 (avg:   66583) ops/sec, 2.64MB/sec (avg: 2.70MB/sec),  0.18 (avg:  0.18) msec latency

3         Threads
4         Connections per thread
60        Seconds
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets        6053.14          ---          ---      0.18000       466.31
Gets       60530.51       124.87     60405.65      0.17600      2298.82
Totals     66583.65       124.87     60405.65      0.17700      2765.13


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET        -nan    100.00000
---
GET       0.049      0.00006
GET       0.050      0.00008
GET       0.051      0.00019
GET       0.052      0.00050
GET       0.053      0.00077
GET       0.054      0.00110
GET       0.055      0.00198
GET       0.056      0.00300
GET       0.057      0.00443
GET       0.058      0.00666
GET       0.059      0.00953
GET       0.060      0.01316
GET       0.061      0.01715
GET       0.062      0.02233
GET       0.063      0.02924
GET       0.064      0.03888
GET       0.065      0.05108
GET       0.066      0.06415
GET       0.067      0.08167
GET       0.068      0.10367
GET       0.069      0.12955
GET       0.070      0.15956
GET       0.071      0.19456
GET       0.072      0.23682
GET       0.073      0.28470
GET       0.074      0.33939
GET       0.075      0.40387
GET       0.076      0.47808
GET       0.077      0.56396
GET       0.078      0.65785
GET       0.079      0.76964
GET       0.080      0.89927
GET       0.081      1.04286
GET       0.082      1.21038
GET       0.083      1.40400
GET       0.084      1.63455
GET       0.085      1.91691
GET       0.086      2.25550
GET       0.087      2.64348
GET       0.088      3.10199
GET       0.089      3.65083
GET       0.090      4.29728
GET       0.091      5.04701
GET       0.092      5.91467
GET       0.093      6.93817
GET       0.094      8.20417
GET       0.095      9.66131
GET       0.096     11.07586
GET       0.097     12.36961
GET       0.098     13.58346
GET       0.099     14.74335
GET       0.100     20.06856
GET       0.110     27.47740
GET       0.120     32.40494
GET       0.130     38.04628
GET       0.140     50.97693
GET       0.150     63.27116
GET       0.160     68.72385
GET       0.170     72.06770
GET       0.180     75.39302
GET       0.190     80.12021
GET       0.200     84.12186
GET       0.210     86.42639
GET       0.220     87.89438
GET       0.230     89.07891
GET       0.240     90.27605
GET       0.250     91.05579
GET       0.260     91.43587
GET       0.270     91.63255
GET       0.280     91.75921
GET       0.290     91.87094
GET       0.300     91.95630
GET       0.310     92.02679
GET       0.320     92.09617
GET       0.330     92.17236
GET       0.340     92.27223
GET       0.350     92.38630
GET       0.360     92.50842
GET       0.370     92.64636
GET       0.380     92.80868
GET       0.390     93.02402
GET       0.400     93.26283
GET       0.410     93.50695
GET       0.420     93.75665
GET       0.430     94.04585
GET       0.440     94.38155
GET       0.450     94.71011
GET       0.460     95.00974
GET       0.470     95.29684
GET       0.480     95.59969
GET       0.490     95.91465
GET       0.500     96.19906
GET       0.510     96.45452
GET       0.520     96.69421
GET       0.530     96.92998
GET       0.540     97.16705
GET       0.550     97.36780
GET       0.560     97.53857
GET       0.570     97.68574
GET       0.580     97.82341
GET       0.590     97.94999
GET       0.600     98.04969
GET       0.610     98.12734
GET       0.620     98.19023
GET       0.630     98.24890
GET       0.640     98.29769
GET       0.650     98.33396
GET       0.660     98.36366
GET       0.670     98.39073
GET       0.680     98.41422
GET       0.690     98.43732
GET       0.700     98.45913
GET       0.710     98.48179
GET       0.720     98.50450
GET       0.730     98.52793
GET       0.740     98.55439
GET       0.750     98.58154
GET       0.760     98.61051
GET       0.770     98.64526
GET       0.780     98.68265
GET       0.790     98.72213
GET       0.800     98.76178
GET       0.810     98.80416
GET       0.820     98.85182
GET       0.830     98.90105
GET       0.840     98.95163
GET       0.850     98.99993
GET       0.860     99.05263
GET       0.870     99.10246
GET       0.880     99.15844
GET       0.890     99.21290
GET       0.900     99.26434
GET       0.910     99.31181
GET       0.920     99.36178
GET       0.930     99.41192
GET       0.940     99.45708
GET       0.950     99.49899
GET       0.960     99.53880
GET       0.970     99.57994
GET       0.980     99.61813
GET       0.990     99.65433
GET       1.000     99.81541
GET       1.100     99.95628
GET       1.200     99.99171
GET       1.300     99.99609
GET       1.400     99.99703
GET       1.500     99.99766
GET       1.600     99.99813
GET       1.700     99.99860
GET       1.800     99.99890
GET       1.900     99.99912
GET       2.000     99.99920
GET       2.100     99.99937
GET       2.200     99.99950
GET       2.300     99.99956
GET       2.400     99.99961
GET       2.600     99.99967
GET       2.800     99.99975
GET       3.300     99.99983
GET       4.100     99.99986
GET       4.200     99.99994
GET       4.600     99.99997
GET       4.700    100.00000